import React from 'react'
import { Link as GatsbyLink } from "gatsby"

import SideMenu from './SideMenu'

import { Nav, Wrap, Ul, Logo, Recruit } from './styled'

const links = [
  { href: '/service', label: '서비스' },
  { href: '/culture', label: '기업문화' },
].map(link => {
  link.key = `nav-link-${link.href}-${link.label}`
  return link
})

const LogoIcon = ({ isOpen = false }) => {
  return (
    <Logo viewBox="0 0 131 19" isOpen={isOpen}>
      <g fill="none" fillRule="evenodd" transform="translate(1)">
        <path strokeWidth=".25" d="M.103 11.995l3.408-.324c.204 1.116.62 1.935 1.245 2.456.628.523 1.474.785 2.54.785 1.125 0 1.975-.233 2.548-.698.572-.466.857-1.009.857-1.632 0-.399-.121-.74-.36-1.02-.242-.281-.66-.525-1.262-.732-.41-.14-1.342-.385-2.801-.738-1.876-.455-3.194-1.012-3.95-1.674C1.26 7.49.73 6.355.73 5.018c0-.861.25-1.667.751-2.417.5-.75 1.222-1.32 2.165-1.713.943-.393 2.08-.587 3.413-.587 2.176 0 3.813.465 4.914 1.395 1.1.93 1.676 2.171 1.733 3.725l-3.503.149c-.148-.868-.468-1.493-.963-1.873-.493-.381-1.232-.57-2.218-.57-1.017 0-1.814.203-2.39.61-.369.262-.554.611-.554 1.05 0 .4.172.742.519 1.025.443.363 1.515.74 3.217 1.13 1.705.393 2.963.798 3.78 1.218.816.42 1.455.992 1.916 1.719.462.725.692 1.623.692 2.692 0 .968-.276 1.876-.828 2.722-.551.845-1.331 1.474-2.342 1.885-1.009.41-2.265.618-3.772.618-2.192 0-3.876-.496-5.052-1.484-1.175-.987-1.876-2.427-2.105-4.317z"/>
        <path strokeWidth=".25" d="M22.99 17.495V3.449h-5.146V.589h13.777v2.86h-5.13v14.046z"/>
        <path strokeWidth=".25" d="M40.825 4.533l-4.852 12.962H32.26L39.016.589h3.7l6.943 16.906h-3.81z"/>
        <path strokeWidth=".25" d="M55.558 17.495V3.449h-5.144V.589h13.781v2.86h-5.134v14.046z"/>
        <path strokeWidth=".25" d="M68.283 17.495h3.504V.588h-3.504z"/>
        <path strokeWidth=".25" d="M79.956 9.031c0 1.914.454 3.365 1.361 4.353.905.989 2.058 1.482 3.453 1.482 1.397 0 2.541-.49 3.436-1.47.894-.981 1.344-2.451 1.344-4.411 0-1.939-.436-3.384-1.31-4.337-.87-.953-2.026-1.43-3.47-1.43-1.443 0-2.605.482-3.49 1.448-.882.965-1.324 2.419-1.324 4.365zm-3.605.114c0-1.722.261-3.167.789-4.336a8.017 8.017 0 0 1 1.616-2.317A6.724 6.724 0 0 1 80.997.97C82.08.524 83.323.3 84.735.3c2.556 0 4.6.773 6.133 2.319C92.4 4.164 93.17 6.313 93.17 9.065c0 2.73-.761 4.865-2.285 6.407-1.52 1.54-3.557 2.312-6.104 2.312-2.577 0-4.628-.768-6.15-2.3-1.52-1.534-2.28-3.648-2.28-6.339z"/>
        <path strokeWidth=".25" d="M97.876 17.495V.589h3.404l7.099 11.29V.589h3.251v16.906h-3.512L101.126 6.47v11.025z"/>
        <path strokeWidth=".25" d="M117.45 13.46l3.446-.408c.11.855.405 1.51.885 1.963.482.452 1.063.678 1.748.678.734 0 1.352-.271 1.855-.814.502-.544.752-1.275.752-2.198 0-.872-.24-1.564-.721-2.073a2.323 2.323 0 0 0-1.759-.765c-.457 0-1.002.086-1.633.258l.391-2.826c.963.025 1.696-.179 2.203-.612.507-.432.76-1.005.76-1.72 0-.61-.186-1.097-.556-1.457-.371-.364-.866-.544-1.482-.544-.61 0-1.128.207-1.558.618-.429.41-.692 1.011-.785 1.8l-3.278-.542c.227-1.094.57-1.968 1.032-2.623.458-.653 1.1-1.168 1.924-1.543.824-.374 1.745-.561 2.766-.561 1.747 0 3.148.542 4.203 1.63.869.888 1.305 1.893 1.305 3.01 0 1.589-.892 2.856-2.672 3.802 1.064.223 1.915.722 2.551 1.495.638.773.956 1.708.956 2.8 0 1.59-.594 2.944-1.785 4.063-1.189 1.119-2.67 1.679-4.444 1.679-1.68 0-3.072-.472-4.177-1.413-1.106-.942-1.749-2.176-1.927-3.697z"/>
      </g>
    </Logo>
  )
}

const Link = ({ children, to, activeClassName, ...other }) => {
  // Tailor the following test to your environment.
  // This example assumes that any internal link (intended for Gatsby)
  // will start with exactly one slash, and that anything else is external.
  const internal = /^\/(?!\/)/.test(to)
  
  // Use Gatsby Link for internal links, and <a> for others
  if (internal) {
    return (
      <GatsbyLink to={to} activeClassName={activeClassName} {...other}>
        {children}
      </GatsbyLink>
    )
  } else {
    return (
      <a href={to} {...other}>
        {children}
      </a>
    )
  }
}

const MenusComponent = () => {
  return (
    <Nav>
      <Wrap>
        <Ul>
          <li>
            <Link to="/home">스테이션3 소개</Link>
          </li>
          {links.map(({ key, href, label }) => (
            <li key={key}>
              <Link to={href}>{label}</Link>
            </li>
          ))}
        </Ul>
        
        <SideMenu LogoIcon={LogoIcon} links={links} />
        
        <Link to="/">
          <LogoIcon />
        </Link>
        
        <Recruit onClick={() => alert('서비스 준비중 입니다.')} role="button">
          {/*<Link to="/culture#recruit">RECRUIT</Link>*/}
          {/* <a style={{cursor: 'pointer'}}>RECRUIT</a> */}
          <p>RECRUIT</p>
        </Recruit>
      </Wrap>
    </Nav>
  )
}

export default MenusComponent
